Repository: BluntlyCat/infosys
Catalog: HSA.InfoSys/HSA.InfoSys.Entities/Properties/Resources.*.resx
Languages: de_de

# COMPONENT_TO_STRING
source: ID: {0}, Name: {1}, OrgUnit: ({2}), {3}.
de_de: ID: {0}, Name: {1}, OrgUnit: ({2}), Size: {3} Bytes.

# ENTITY_SIZEOF_ERROR
source: Error while detecting size: {0}.
de_de: Fehler beim Berechnen der Größe {0}.

# ENTITY_SIZE_OF
source: Entity has size of {0} Bytes.
de_de: Die Entity hat eine Größe von {0} Bytes.

# ENTITY_TO_STRING
source: ID: {0}, {1}.
de_de: ID: {0}, Size: {1} Bytes.

# MAILNOTIFIERSETTINGS_TO_STRING
source: Smtp-Server: {0}, Mail from: {1}, {2}.
de_de: SMTP server: {0}, SMTP port: {1}, Mail from: {2}, Size: {3} Bytes.

# NUTCHCONTROLLERSETTINGS_TO_STRING
source: Host: {0}, seed file name {1}, base url path {2}, nutch command {3}, crawl request {4}, {5}.
de_de: HomePath: {0}, NutchPath: {1}, NutchCommand: {2}, NutchClients: {3}, CrawlDepth: {4}, CrawlTopN: {5}, SolrServer: {6}, JavaHome: {7}, CertificatePath: {8}, Prefix: {9}, CrawlRequest: {10}, SeedFileName: {11}, PrefixFileName: {12}, BaseUrlPath: {13}, BaseCrawlPath: {14}, PathFormatTwo: {15}, PathFormatThree: {16}, PathFormatFour: {17}, PrefixFormat: {18}, Size: {19} Bytes

# ORGUNITCONFIG_TO_STRING
source: ID: {0}, URLs: {1}, Urls active: {2}, Mails: {3}, Mails active: {4}, Schedule every {5} days at ({6}), Scheduler active: {7}, {8}.
de_de: ID: {0}, URLs: {1}, Urls active: {2}, Mails: {3}, Mails active: {4}, Schedule every {5} days at ({6}), Scheduler active: {7}, Size: {8} Bytes.

# ORGUNIT_TO_STRING
source: ID: {0}, UserId: {1}, Name: {2}, OrgUnitConfig: ({3}), {4}.
de_de: ID: {0}, UserId: {1}, Name: {2}, OrgUnitConfig: ({3}), Size: {4} Bytes.

# RESULT_TO_STRING
source: ID: {0}, Component: {1}, Title: {2}, URL: {3}, Content: {4}, Time: {5}, {6}.
de_de: ID: {0}, Component: {1}, Title: {2}, URL: {3}, Content: {4}, Time: {5}, Size: {6} Bytes.

# SOLRSEARCHCLIENTSETTINGS_TO_STRING
source: Host: {0}, Port: {1}, Collection: {2}, QueryFormat: {3}, RequestFormat: {4}, FilterFormat: {5}, Filter: {6}, {7}.
de_de: Host: {0}, Port: {1}, Collection: {2}, FilterQuery: {3}, RequestFormat: {4}, QueryFormat {5}, Size: {6} Bytes.
