Repository: BluntlyCat/infosys
Catalog: HSA.InfoSys/HSA.InfoSys.Services/Properties/Resources.*.resx
Languages: de_de

# CRAWL_CONTROLLER_SHUTDOWN
source: Shutdown Services.
de_de: Beende alle Dienste.

# CRAWL_CONTROLLER_START
source: Start crawl controller
de_de: Starte crawl controller

# DBMANAGER_ADD_ENTITY
source: Instance saved successfully in database.
de_de: Instanz erfolgreich in der Datenbank gespeichert.

# DBMANAGER_CREATE_COMPONENT
source: New component [{0}] created.
de_de: Neue Komponente [{0}] erstellt.

# DBMANAGER_CREATE_ORGUNIT
source: New org unit [{0}] created.
de_de: Neue Org Unit [{0}] erstellt.

# DBMANAGER_CREATE_ORGUNITCONFIG
source: New org unit configuration [{0}] created.
de_de: Neue Org Unit Konfiguration [{0}] erstellt.

# DBMANAGER_CREATE_RESULT
source: New result [{0}] created.
de_de: Neues Result [{0}] erstellt.

# DBMANAGER_CREATE_SCHEDULER
source: New scheduler [{0}] created.
de_de: Neuer Scheduler [{0}] erstellt.

# DBMANAGER_CREATE_SOURCE
source: New source [{0}] created.
de_de: Neue Quelle [{0}] erstellt.

# DBMANAGER_CREATE_SYSTEMSERVICE
source: New systemservice [{0}] created.
de_de: Neues Systemservice [{0}] erstellt.

# DBMANAGER_DELETE_ENTITY
source: Deleted entity [{0}]
de_de: Entity gelöscht [{0}]

# DBMANAGER_EAGER_LOAD_THIS_ENTITIES
source: Load this entities [{0}] eager from database.
de_de: Lädt die Instanzen [{0}] aus der Datenbank.

# DBMANAGER_GET_COMPONENT_BY_ORGUNIT_ID
source: Got components: [{0}] by GUID: [{1}].
de_de: Components: [{0}] durch GUID: [{1}] erhalten.

# DBMANAGER_GET_ENTITY
source: Got entity of type [{0}] with values [{1}] by GUID [{2}]
de_de: Instanz vom Typ [{0}] mit Werten [{1}] durch GUID [{2}] erhalten

# DBMANAGER_GET_ORGUNIT_BY_USERID
source: Got org unit [{0}] by id [{1}]
de_de: Org Unit [{0}] durch id [{1}] erhalten.

# DBMANAGER_NO_MANAGER_FOUND
source: DBManager does not exist, create one.
de_de: DBManager existiert nicht, es wird ein neuer erstellt.

# DBMANAGER_UPDATE_ENTITY
source: Instance updated successfully in database.
de_de: Instanz erfolgreich in der Datenbank aktualisiert.

# DBSESSION_NHIBERNATE_CONFIG_READY
source: NHibernate successfully configured.
de_de: NHibernate wurde erfolgreich konfiguriert.

# DBSESSION_OPEN_SESSION
source: Open new session.
de_de: Öffne neue Session.

# ERROR_TIME_INIT
source: Error during time initialisation, error was:\n{0}
de_de: Fehler während der Zeiterfassung, Fehler war:\n{0}

# LOG_DISPATCHER_ZERO
source: Job dispatcher timer reached zero.
de_de: Der Timer des Jobverteilerdienstes ist abgelaufen.

# LOG_FETCH_JOBS_FROM_DB
source: Fetch jobs from database.
de_de: Hohle SchedulerTimer aus Datenbank.

# LOG_GOT_SCHEDULER_LIST_FROM_DB
source: Got SchdulerTimer from database:[{0}]
de_de: Scheduler aus Datenbank erhalten: [{0}]

# LOG_INSTANCIATE_NEW_SCHEDULER
source: Instanciate a new scheduler.
de_de: Erstelle eine neue Scheduler Instanz.

# LOG_RESTART_DISPATCHER
source: Job dispatcher timer restarted.
de_de: Der Timer des Jobverteilerdienst wurde neu gestartet.

# LOG_SCHEDULER_ADD
source: Add SchedulerTimer [{0}]
de_de: Neue SchedulerTime hinzugefügt: [{0}]

# LOG_SCHEDULER_ALREADY_EXIST
source: The SchedulerTimer already exists.
de_de: Die SchedulerTime existiert bereits.

# LOG_START_SERVICE
source: Start service {0}.
de_de: Starte Service {0}.

# LOG_STOP_SERVICE
source: Stop service {0}.
de_de: Stoppe Service {0}.

# LOG_TIME_VALIDATION_ERROR
source: An error occured in countdown [{0}], message was: [{1}].
de_de: In Countdown [{0}] ist ein Fehler aufgetreten, Fehlermeldung: [{1}].

# NUTCH_CONTROLLER_SET_PENDING_CRAWL
source: Set pending job for urls: {0}
de_de: Set pending job: org unit: {0}, user: {1}

# RESULT_TO_STRING
source: Issue {0} found on website: {1}, content: {2} at {3}
de_de: ID: {0}, Komponente: {1}, Titel: {2}, URL: {3}, Inhalt: {4}, Time: {5}

# SCHEDULER_ON_TICK
source: Countdown [{0}] has remaintime: [{1}].
de_de: Verbleibende Zeit: [{0}].

# SEARCH_RECALL
source: Recall for OrgUnit [{0}]
de_de: Rückruf für OrgUnit [{0}]

# SEARCH_RECALL_START_SERVICE
source: New search started, running searches: [{0}]
de_de: Neue Suche wurde gestartet, laufende Suchen: [{0}]

# SEARCH_RECALL_THREAD_STATE
source: Current thread state running: {0}, running searches: {1}, timeout: {2}
de_de: Aktueller laufender Threadstatus: {0}, laufende Suchen: {1}, Timeout: {2}

# SEARCH_RECALL_THREAD_STATE_END
source: Thread state at end running: {0}, running searches: {1}, timeout: {2}
de_de: Threadsstatus am Ende: {0}, laufende Suchen: {1}, Timeout: {2}

# SOLR_CLIENT_CLOSE_CONNECTION
source: Close Connection
de_de: Schließe Verbindung.

# SOLR_CLIENT_CONNECTION_ESTABLISHED
source: Connection Established to host: [{0}]
de_de: Verbindung zu Host hergestellt: [{0}]

# SOLR_CLIENT_MESSAGE_SENT
source: Message was send: [{0}]
de_de: Nachricht gesendet: [{0}]

# SOLR_CLIENT_REQUEST_RECEIVED
source: Received a request for a solr query: [{0}]
de_de: Antwort für Anfrage an Solr empfangen: [{0}]

# SOLR_CLIENT_RESULT_RECEIVED
source: Message from host: [{0}] received with content: [{1}]
de_de: Nachricht von Host: [{0}] empfangen: [{1}]

# SOLR_CLIENT_SOCKET_CLOSED
source: Socket to host: [{0}] closed.
de_de: Socket zu host: [{0}] geschlossen.

# SOLR_CLIENT_TRY_GET_RESPONSE
source: Waiting for response from Solr.
de_de: Warte auf Antwort von Solr.

# SOLR_CLIENT_UNABLE_TO_CONNECT
source: Unable to Connect to host: [{0}]
de_de: Verbindung konnte nicht hergestellt werden: [{0}]

# SOLR_SEARCH_RESULT
source: Response for query [{0}] is: [{1}]
de_de: Antwort für Anfrage [{0}] ist: [{1}]

# WCF_CONTROLLER_WCF_HOST_CLOSED
source: WCF service host {0} closed.
de_de: WCF service Host {0} beendet.

# WCF_CONTROLLER_WCF_HOST_OPENED
source: WCF service host {0} opened.
de_de: WCF service Host {0} gestartet.
