Repository: BluntlyCat/infosys
Catalog: HSA.InfoSys/HSA.InfoSys.Timing/Properties/Resources.*.resx
Languages: de_de

# COUNTDOWN_TO_STRING
source: Countdown time: [{0}], source: [{1}]
de_de: Countdown Zeit: [{0}], Quelle: [{1}]

# LOG_COUNTDOWN_INITIALIZE
source: Initialize a new instance of Countdown
de_de: Initialisiere neuen Countdown.

# LOG_COUNTDOWN_INITIALIZE_PARAMS
source: Initialize a new instance of Countdown with time [{0}]
de_de: Initialisiere neuen Countdown mit Zeit [{0}].

# LOG_COUNTDOWN_RESET_VALUES
source: All values cleaned: [{0}, {1}].
de_de: Alle Werte zurückgesetzt: [{0}, {1}].

# LOG_COUNTDOWN_SET_NEW_REPEAT_TIME
source: New time [{0}] set to repeat.
de_de: Neue Zeit [{0}] zur Wiederholung gesetzt.

# LOG_COUNTDOWN_SET_REPEAT_TIME
source: Set new repeat time.
de_de: Setze neue Zeit zur Wiederholung.

# LOG_COUNTDOWN_START_COUNTDOWN
source: Start new countdown.
de_de: Starte neuen Countdown.

# LOG_COUNTDOWN_START_COUNTDOWN_ERROR
source: Could not start countdown, time is not set: [{0}]
de_de: Countdown konnte nicht gestartet werden, Zeit wurde nicht gesetzt: [{0}]

# LOG_COUNTDOWN_STOP_COUNTDOWN
source: Stop countdown.
de_de: Stoppe Countdown.

# LOG_COUNTDOWN_THREAD_ENDS
source: Thread left while loop.
de_de: Thread verlässt while-Schleife.

# LOG_COUNTDOWN_THREAD_IS_RUNNING
source: Thread is running.
de_de: Thread läuft.

# LOG_REMAIN_TIME_GET_DAYS
source: Get Days [{0}]
de_de: Hole Tage [{0}].

# LOG_REMAIN_TIME_GET_HOURS
source: Get Hours [{0}]
de_de: Hole Stunden [{0}].

# LOG_REMAIN_TIME_GET_MILLISECONDS
source: Get Milliseconds [{0}]
de_de: Hole Millisekunden [{0}].

# LOG_REMAIN_TIME_GET_MINUTES
source: Get Minutes [{0}]
de_de: Hole Minuten [{0}].

# LOG_REMAIN_TIME_GET_SECONDS
source: Get Seconds [{0}]
de_de: Hole Sekunden [{0}].

# LOG_REMAIN_TIME_INITIALIZE
source: Initialize a new instance of RemainTime with TimeSpan [{0}]
de_de: Initialisiere neues RemainTime Objekt mit Zeitspanne: [{0}].

# LOG_REMAIN_TIME_TO_STRING
source: Remaining time: [ID: {0} - {1}D : {2}H : {3}m : {4}s]
de_de: Verbleibende Zeit: [ID: {0} - {1}T : {2}S : {3}m : {4}s]

# LOG_RESET_VALUES
source: Values reset.
de_de: Werte zurückgesetzt.

# LOG_TIME_RESET_VALUES
source: Values reset [Starttime: {0}, Endtime: {1}, Remaintime: {2}, Type: {3}, Params: {4}, Timestring: {5}].
de_de: Werte zurückgesetzt [Startzeit: {0}, Endzeit: {1}, Verbleibend: {2}, Typ: {3}, Parameter: {4}, Zeitstring: {5}].

# LOG_TIME_SET_TIME
source: Set time.
de_de: Setze Zeit.

# LOG_TIME_SET_TIME_PARAM_DATETIME
source: Set time with param [{0}].
de_de: Setze Zeit mit Parameter [{0}].

# LOG_TIME_VALIDATION_BEGIN_VALIDATION
source: Validate time [{0}].
de_de: Validiere Zeit [{0}].

# LOG_TIME_VALIDATION_EMPTY_STRING
source: Time [{0}] is empty.
de_de: Zeit [{0}] ist leer.

# LOG_TIME_VALIDATION_GOT_VALUES_OF_TYPE_DATE
source: Got values from timestring [{0}, {1}, {2}]
de_de: Folgende Werte vom Zeitstring erhalten: [{0}, {1}, {2}].

# LOG_TIME_VALIDATION_GOT_VALUES_OF_TYPE_TIME
source: Got values from timestring [{0}, {1}]
de_de: Folgende Werte vom Zeitstring erhalten: [{0}, {1}].

# LOG_TIME_VALIDATION_HAS_SEPARATORS
source: Time [{0}] has separators.
de_de: Zeit [{0}] hat Separatoren.

# LOG_TIME_VALIDATION_HAS_SEPARATOR_AT_INDEX
source: Time [{0}] has separator at index [{1}].
de_de: Zeit [{0}] hat Separator an Position [{1}].

# LOG_TIME_VALIDATION_INVALID_CHARS
source: Time [{0}] has invalid characters.
de_de: Zeit [{0}] enthält ungültige Zeichen.

# LOG_TIME_VALIDATION_INVALID_LENGTH
source: Time [{0}] has invalid length [{1}]
de_de: Zeit [{0}] hat ungültige Länge [{1}]

# LOG_TIME_VALIDATION_INVALID_TIME_FORMAT
source: Error while parsing time [{0}], with error:\n[{2}].
de_de: Fehler beim Parsen des Zeitstrings [{0}], Fehler:\n[{2}].

# LOG_TIME_VALIDATION_INVALID_TYPE_OF_TIME
source: Time has invalid type of {0}
de_de: Zeit hat ungültigen Typ: [{0}].

# LOG_TIME_VALIDATION_IS_NOT_VALID
source: Time [{0}] is not valid, error was: [{1}].
de_de: Zeit [{0}] ist ungültig, Fehler war: [{1}].

# LOG_TIME_VALIDATION_IS_VALID
source: Time [{0}] is valid.
de_de: Zeit [{0}] ist gültig.

# LOG_TIME_VALIDATION_NO_SEPARATORS
source: Time [{0}] has no separators.
de_de: Zeit [{0}] hat keine Separatoren.

# LOG_TIME_VALIDATION_NO_SEPARATORS_NEEDED
source: Time [{0}] does not need separators.
de_de: Zeit [{0}] benötigt keine Separatoren.

# LOG_TIME_VALIDATION_NO_SEPARATOR_AT_INDEX
source: Time [{0}] has no separator at index [{1}].
de_de: Zeit [{0}] hat keine Separatoren an Position [{1}].

# LOG_TIME_VALIDATION_SET_IF_IN_FUTURE
source: Time [{0}].
de_de: Zeit: [{0}].

# LOG_TIME_VALIDATION_SET_TYPE_OF_TIME
source: Set type of time for timestring {0}
de_de: Setze Zeittyp für Zeit [{0}]

# LOG_TIME_VALIDATION_STRING_IS_TYPE_OF
source: Timestring is type of [{0}]
de_de: Zeitstring ist vom Typ: [{0}]

# LOG_TIME_VALIDATION_TIME_IN_PAST
source: Timestring is in past.
de_de: Zeit liegt in der Vergangenheit.

# LOG_TIME_VALIDATION_VALID_CHARS
source: Time [{0}] has valid characters.
de_de: Zeit [{0}] enthält gültige Zeichen.

# LOG_TIME_VALIDATION_VALID_LENGTH
source: Time [{0}] has valid length [{1}].
de_de: Zeit [{0}] hat gültige Länge [{1}].

# LOG_TIME_VALIDATION_WRONG_PLACED_SEPARATOR
source: Time [{0}] has wrong placed separators.
de_de: Zeit [{0}] hat falsch platzierte Separatoren.

# LOG_TIME_VALIDATION_WRONG_PLACED_SEPARATOR_AT_INDEX
source: Time [{0}] has wrong placed separator at index [{1}].
de_de: Zeit [{0}] hat falsch platzierte Separatoren an Position [{1}].

# SCHEDULER_ON_TICK
source: Remaintime: [{0}].
de_de: Verbleibende Zeit: [{0}].

# TIME_TO_STRING
source: ID: {0}, repeat: {1}, repeat in: {2} hours.
de_de: Startzeit: {0}, Endzeit: {1}, Verbleibend: {2}

# TIME_VALIDATION_EMPTY_STRING
source: Timestring must not be empty.
de_de: Der Zeitstring darf nicht leer sein.

# TIME_VALIDATION_ERROR_HAS_NO_SEPARATORS
source: Time must have separatos ('.' or ':').
de_de: Zeit benötigt Separatoren ('.' oder ':').

# TIME_VALIDATION_ERROR_INVALID_CHARS
source: Time has invalid characters.
de_de: Zeit enthält ungültige Zeichen.

# TIME_VALIDATION_ERROR_INVALID_LENGTH
source: Time has invalid length.
de_de: Zeit hat eine ungültige Länge.

# TIME_VALIDATION_ERROR_INVALID_TIME_FORMAT
source: Invalid time format for time
de_de: Das Zeitformat ist ungültig.

# TIME_VALIDATION_ERROR_INVALID_TYPE_OF_TIME
source: Invalid type of time [{0}]
de_de: Der Zeittyp {0} ist ungültig.

# TIME_VALIDATION_ERROR_NO_SEPARATOR_AT_INDEX
source: Time has no separators at index {0}.
de_de: Die Zeit hat keine Separatoren an Position {0}.

# TIME_VALIDATION_ERROR_TIME_IN_PAST
source: Timestring is in past.
de_de: Die Zeit liegt in der Vergangenheit.

# TIME_VALIDATION_ERROR_TIME_NOT_VALID
source: Time is not valid.
de_de: Die eingegebene Zeit ist ungültig.

# TIME_VALIDATION_ERROR_WRONG_PLACED_SEPARATOR_AT_INDEX
source: Time has wrong placed separator at index [{0}].
de_de: Die Zeit hat falsch platzierte Separatoren an Position [{0}].
